; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v1)
             (pred_3 ?v5 ?v12)
             (pred_5 ?v4 ?v12)
             (pred_11 ?v2 ?v4 )
	     (pred_2 ?v4)
             (pred_4 ?v13)
             (pred_12 ?v5)
             (pred_7 ?v12)
             (pred_8 ?v4)
             (pred_10 ?v5)
             (pred_9 ?v4)
             (pred_6 ))



(:action op_5
:parameters (?v8 ?v7 ?v6 ?v3)
:precondition (and (pred_4 ?v8) (pred_4 ?v7) (pred_12 ?v6) (pred_7 ?v3)
          (pred_1 ?v8 ?v7) (pred_3 ?v6 ?v3)
                   (pred_5 ?v7 ?v3) (pred_2 ?v8) 
                   (pred_8 ?v7) (pred_10 ?v6))
:effect (and  (pred_9 ?v7) (not (pred_8 ?v7))))


(:action op_2
:parameters (?v8 ?v11)
:precondition (and (pred_4 ?v8) (pred_4 ?v11)
               (pred_2 ?v8) (pred_1 ?v8 ?v11) (pred_9 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v8))))

(:action op_1
:parameters (?v8 ?v6)
:precondition (and (pred_4 ?v8) (pred_12 ?v6) 
                  (pred_2 ?v8) (pred_11 ?v6 ?v8) (pred_6 ))
:effect (and (pred_10 ?v6)
   (not (pred_11 ?v6 ?v8)) (not (pred_6 ))))


(:action op_3
:parameters (?v8 ?v10 ?v9)
:precondition (and (pred_4 ?v8) (pred_12 ?v10) (pred_12 ?v9)
                  (pred_2 ?v8) (pred_10 ?v9) (pred_11 ?v10 ?v8))
:effect (and (pred_10 ?v10) (pred_11 ?v9 ?v8)
        (not (pred_10 ?v9)) (not (pred_11 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v6)
:precondition (and (pred_4 ?v8) (pred_12 ?v6) 
                  (pred_2 ?v8) (pred_10 ?v6))
:effect (and (pred_6 ) (pred_11 ?v6 ?v8) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_11 obj_09 obj_20 obj_18 obj_03 obj_24 obj_22 obj_16 obj_15 obj_12 obj_06 obj_21 obj_14 obj_07 obj_13 obj_02 obj_27 obj_25 obj_10 obj_19 obj_30 obj_26 obj_28 obj_04
    obj_05 obj_29
    obj_23 obj_17 obj_01
    )

    (:init
       (pred_6)

       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_4 obj_20)
       (pred_4 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_24)
       (pred_4 obj_22)
       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_06)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_02)
       (pred_4 obj_27)
       (pred_4 obj_25)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_30)
       (pred_4 obj_26)
       (pred_4 obj_28)
       (pred_4 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_29)
       (pred_12 obj_23)
       (pred_12 obj_17)
       (pred_12 obj_01)

       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_11 obj_24)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_09 obj_22)
       (pred_1 obj_09 obj_20)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_20 obj_16)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_20 obj_09)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_24 obj_06)
       (pred_1 obj_24 obj_22)
       (pred_1 obj_24 obj_11)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_22 obj_21)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_09)
       (pred_1 obj_22 obj_24)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_20)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_12 obj_13)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_06 obj_02)
       (pred_1 obj_06 obj_21)
       (pred_1 obj_06 obj_24)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_21 obj_27)
       (pred_1 obj_21 obj_14)
       (pred_1 obj_21 obj_22)
       (pred_1 obj_21 obj_06)
       (pred_1 obj_14 obj_25)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_21)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_12)
       (pred_1 obj_02 obj_30)
       (pred_1 obj_02 obj_27)
       (pred_1 obj_02 obj_06)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_27 obj_26)
       (pred_1 obj_27 obj_25)
       (pred_1 obj_27 obj_21)
       (pred_1 obj_27 obj_02)
       (pred_1 obj_25 obj_28)
       (pred_1 obj_25 obj_10)
       (pred_1 obj_25 obj_14)
       (pred_1 obj_25 obj_27)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_25)
       (pred_1 obj_19 obj_30)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_30 obj_26)
       (pred_1 obj_30 obj_02)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_26 obj_28)
       (pred_1 obj_26 obj_27)
       (pred_1 obj_26 obj_30)
       (pred_1 obj_28 obj_04)
       (pred_1 obj_28 obj_25)
       (pred_1 obj_28 obj_26)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_28)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_5  obj_19 obj_05)
       (pred_5  obj_04 obj_29)
       (pred_5  obj_02 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_9 obj_18)
       (pred_9 obj_03)
       (pred_9 obj_24)
       (pred_9 obj_22)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_27)
       (pred_9 obj_25)
       (pred_9 obj_10)
       (pred_9 obj_30)
       (pred_9 obj_26)
       (pred_9 obj_28)

       (pred_3  obj_23 obj_05)
       (pred_3  obj_17 obj_29)
       (pred_3  obj_01 obj_29)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_01 obj_08)
       (pred_2 obj_09)
    )

    (:goal (and
       (pred_11 obj_01 obj_06)
    ))
(:constraints
  (always (not (pred_2 obj_11)))
)
)

; plan
1. (op_2 obj_09 obj_22)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_22)
   goals met: 0 of 1
2. (op_2 obj_22 obj_24)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_24)
   goals met: 0 of 1
3. (op_2 obj_24 obj_03)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_03)
   goals met: 0 of 1
4. (op_2 obj_03 obj_08)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_01)
   deleted: (pred_11 obj_01 obj_08) (pred_6)
   added: (pred_10 obj_01)
   goals met: 0 of 1
6. (op_2 obj_08 obj_03)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_03)
   goals met: 0 of 1
7. (op_2 obj_03 obj_24)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_24)
   goals met: 0 of 1
8. (op_2 obj_24 obj_06)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_06)
   goals met: 0 of 1
9. (op_4 obj_06 obj_01)
   deleted: (pred_10 obj_01)
   added: (pred_6) (pred_11 obj_01 obj_06)
   goals met: 1 of 1
